# from random import random as r, choice as rc 
# sub, obj = ['我','系統'] , ['程式','邏輯','想法','流程','設計','樣本','聲音','連結','節奏','結構']
# adj1 ,adj2 = ['重複','隨機'], ['規律','混沌']
# rn1 = round(r()) ; rn2 = abs(rn1-1)
# print(f"""{rc(sub)}在{adj1[rn1]}中尋找{adj1[rn2]}性，
#     將{adj2[rn1]}放進{adj2[rn2]}裏，{rc(['決定','隨心'])}把{rc(obj)}{rc(['組合','拆分'])}，
#     {rc(['','不'])}操控其{rc(['抽取','擴展'])}程序，
#     由{rc(sub)}在{rc(['有','無'])}意識的情況下{rc(['編排','即興'])}，
#     把創作{rc(['抽象','具體'])}化，
#     {rc(['此刻','過程'])}{rc(['有','無'])}可能{rc(['穩定','失控'])}。
#     """.replace('\n','').replace(' ',''))
print('我在嘗試用編程玩音樂。')
